In [2]:
import numpy as np
import pandas as pd

In [6]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, np.nan, 98]}

df = pd.DataFrame(dict)

In [7]:
df

     name  degree  score
0  aparna     MBA   90.0
1  pankaj     BCA   40.0
2  sudhir  M.Tech    NaN
3   Geeku     MBA   98.0

In [10]:
df.isna()

    name  degree  score
0  False   False  False
1  False   False  False
2  False   False   True
3  False   False  False

In [11]:
df.isna().sum()

name      0
degree    0
score     1
dtype: int64

In [12]:
df

     name  degree  score
0  aparna     MBA   90.0
1  pankaj     BCA   40.0
2  sudhir  M.Tech    NaN
3   Geeku     MBA   98.0

In [13]:
df.dropna()

     name degree  score
0  aparna    MBA   90.0
1  pankaj    BCA   40.0
3   Geeku    MBA   98.0

In [15]:
df

     name  degree  score
0  aparna     MBA   90.0
1  pankaj     BCA   40.0
2  sudhir  M.Tech    NaN
3   Geeku     MBA   98.0

In [16]:
df.fillna(0)

     name  degree  score
0  aparna     MBA   90.0
1  pankaj     BCA   40.0
2  sudhir  M.Tech    0.0
3   Geeku     MBA   98.0

In [17]:
df

     name  degree  score
0  aparna     MBA   90.0
1  pankaj     BCA   40.0
2  sudhir  M.Tech    NaN
3   Geeku     MBA   98.0

In [20]:
values = {'A': 0, 'B': 100, 'score': 300, 'D': 400}
df.fillna(value=values)

     name  degree  score
0  aparna     MBA   90.0
1  pankaj     BCA   40.0
2  sudhir  M.Tech  300.0
3   Geeku     MBA   98.0